Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_tim_ex.c
  switch (BreakInput)
  {
    case TIM_BREAKINPUT_BRK:
    {
      /* Get the TIMx_AF1 register value */
      tmporx = htim->Instance->AF1;

      /* Enable the break input */
      tmporx &= ~bkin_enable_mask;
      tmporx |= (sBreakInputConfig->Enable << bkin_enable_bitpos) & bkin_enable_mask;

      /* Set the break input polarity */
      tmporx &= ~bkin_polarity_mask;
      tmporx |= (sBreakInputConfig->Polarity << bkin_polarity_bitpos) & bkin_polarity_mask;

      /* Set TIMx_AF1 */
      htim->Instance->AF1 = tmporx;
      break;
    }
    case TIM_BREAKINPUT_BRK2:
    {
      /* Get the TIMx_AF2 register value */
      tmporx = htim->Instance->AF2;

      /* Enable the break input */
      tmporx &= ~bkin_enable_mask;
      tmporx |= (sBreakInputConfig->Enable << bkin_enable_bitpos) & bkin_enable_mask;

      /* Set the break input polarity */
      tmporx &= ~bkin_polarity_mask;
      tmporx |= (sBreakInputConfig->Polarity << bkin_polarity_bitpos) & bkin_polarity_mask;

      /* Set TIMx_AF2 */
      htim->Instance->AF2 = tmporx;
      break;
    }
    default:
      status = HAL_ERROR;
      break;
  }

  __HAL_UNLOCK(htim);

  return status;
}

/**
  * @brief  Configures the TIMx Remapping input capabilities.
  * @param  htim TIM handle.
  * @param  Remap specifies the TIM remapping source.
  *         For TIM1, the parameter can take one of the following values:
  *            @arg TIM_TIM1_ETR_GPIO           TIM1 ETR is connected to GPIO
  *            @arg TIM_TIM1_ETR_COMP1          TIM1 ETR is connected to COMP1 output
  *            @arg TIM_TIM1_ETR_COMP2          TIM1 ETR is connected to COMP2 output
  *            @arg TIM_TIM1_ETR_COMP3          TIM1 ETR is connected to COMP3 output
  *            @arg TIM_TIM1_ETR_COMP4          TIM1 ETR is connected to COMP4 output
  *            @arg TIM_TIM1_ETR_ADC1_AWD1      TIM1 ETR is connected to ADC1 AWD1
  *            @arg TIM_TIM1_ETR_ADC1_AWD2      TIM1 ETR is connected to ADC1 AWD2
  *            @arg TIM_TIM1_ETR_ADC1_AWD3      TIM1 ETR is connected to ADC1 AWD3
  *
  *         For TIM2, the parameter can take one of the following values:
  *            @arg TIM_TIM2_ETR_GPIO           TIM2 ETR is connected to GPIO
  *            @arg TIM_TIM2_ETR_COMP1          TIM2 ETR is connected to COMP1 output
  *            @arg TIM_TIM2_ETR_COMP2          TIM2 ETR is connected to COMP2 output
  *            @arg TIM_TIM2_ETR_COMP3          TIM2 ETR is connected to COMP3 output
  *            @arg TIM_TIM2_ETR_COMP4          TIM2 ETR is connected to COMP4 output
  *            @arg TIM_TIM2_ETR_TIM3_ETR       TIM2 ETR is connected to TIM3 ETR pin
  *            @arg TIM_TIM2_ETR_TIM4_ETR       TIM2 ETR is connected to TIM4 ETR pin
  *            @arg TIM_TIM2_ETR_TIM5_ETR       TIM2 ETR is connected to TIM5 ETR pin
  *            @arg TIM_TIM2_ETR_TIM18_ETR      TIM2 ETR is connected to TIM18 ETR pin
  *
  *         For TIM3, the parameter can take one of the following values:
  *            @arg TIM_TIM3_ETR_GPIO           TIM3 ETR is connected to GPIO
  *            @arg TIM_TIM3_ETR_COMP1          TIM3 ETR is connected to COMP1 output
  *            @arg TIM_TIM3_ETR_COMP2          TIM3 ETR is connected to COMP2 output
  *            @arg TIM_TIM3_ETR_COMP3          TIM3 ETR is connected to COMP3 output
  *            @arg TIM_TIM3_ETR_COMP4          TIM3 ETR is connected to COMP4 output
  *            @arg TIM_TIM3_ETR_TIM2_ETR       TIM3 ETR is connected to TIM2 ETR pin
  *            @arg TIM_TIM3_ETR_TIM4_ETR       TIM3 ETR is connected to TIM4 ETR pin
  *            @arg TIM_TIM3_ETR_ADC2_AWD1      TIM3 ETR is connected to ADC2 AWD1
  *            @arg TIM_TIM3_ETR_ADC2_AWD2      TIM3 ETR is connected to ADC2 AWD2
  *            @arg TIM_TIM3_ETR_ADC2_AWD3      TIM3 ETR is connected to ADC2 AWD3
  *
  *         For TIM4, the parameter can take one of the following values:
  *            @arg TIM_TIM4_ETR_GPIO           TIM4 ETR is connected to GPIO
  *            @arg TIM_TIM4_ETR_COMP1          TIM4 ETR is connected to COMP1 output
  *            @arg TIM_TIM4_ETR_COMP2          TIM4 ETR is connected to COMP2 output
  *            @arg TIM_TIM4_ETR_COMP3          TIM4 ETR is connected to COMP3 output
  *            @arg TIM_TIM4_ETR_COMP4          TIM4 ETR is connected to COMP4 output
  *            @arg TIM_TIM4_ETR_TIM3_ETR       TIM4 ETR is connected to TIM3 ETR pin
  *            @arg TIM_TIM4_ETR_TIM5_ETR       TIM4 ETR is connected to TIM5 ETR pin
  *            @arg TIM_TIM4_ETR_TIM18_ETR      TIM4 ETR is connected to TIM18 ETR pin
  *
  *         For TIM5, the parameter can take one of the following values:       
  *            @arg TIM_TIM5_ETR_GPIO           TIM5 ETR is connected to GPIO            
  *            @arg TIM_TIM5_ETR_COMP1          TIM5 ETR is connected to COMP1 output    
  *            @arg TIM_TIM5_ETR_COMP2          TIM5 ETR is connected to COMP2 output    
  *            @arg TIM_TIM5_ETR_COMP3          TIM5 ETR is connected to COMP3 output    
  *            @arg TIM_TIM5_ETR_COMP4          TIM5 ETR is connected to COMP4 output    
  *            @arg TIM_TIM5_ETR_TIM2_ETR       TIM5 ETR is connected to TIM2 ETR pin    
  *            @arg TIM_TIM5_ETR_TIM3_ETR       TIM5 ETR is connected to TIM3 ETR pin    
  *            @arg TIM_TIM5_ETR_TIM18_ETR      TIM5 ETR is connected to TIM18 ETR pin    
  *
  *         For TIM8, the parameter can take one of the following values:
  *            @arg TIM_TIM8_ETR_GPIO            TIM8 ETR is connected to GPIO
  *            @arg TIM_TIM8_ETR_COMP1           TIM8 ETR is connected to COMP1 output
  *            @arg TIM_TIM8_ETR_COMP2           TIM8 ETR is connected to COMP2 output
  *            @arg TIM_TIM8_ETR_COMP3           TIM8 ETR is connected to COMP3 output
  *            @arg TIM_TIM8_ETR_COMP4           TIM8 ETR is connected to COMP4 output
  *            @arg TIM_TIM8_ETR_ADC2_AWD1       TIM8 ETR is connected to ADC2 AWD1
  *            @arg TIM_TIM8_ETR_ADC2_AWD2       TIM8 ETR is connected to ADC2 AWD2
  *            @arg TIM_TIM8_ETR_ADC2_AWD3       TIM8 ETR is connected to ADC2 AWD3
  *            @arg TIM_TIM8_ETR_ADC3_AWD1       TIM8 ETR is connected to ADC3 AWD1
  *            @arg TIM_TIM8_ETR_ADC3_AWD2       TIM8 ETR is connected to ADC3 AWD2
  *            @arg TIM_TIM8_ETR_ADC3_AWD3       TIM8 ETR is connected to ADC3 AWD3 
  *
  *         For TIM18, the parameter can take one of the following values:       
  *            @arg TIM_TIM18_ETR_GPIO            TIM18 ETR is connected to GPIO
  *            @arg TIM_TIM18_ETR_COMP1           TIM18 ETR is connected to COMP1 output  
  *            @arg TIM_TIM18_ETR_COMP2           TIM18 ETR is connected to COMP2 output  
  *            @arg TIM_TIM18_ETR_COMP3           TIM18 ETR is connected to COMP3 output 
  *            @arg TIM_TIM18_ETR_COMP4           TIM18 ETR is connected to COMP4 output  
  *            @arg TIM_TIM18_ETR_TIM3_ETR        TIM18 ETR is connected to TIM3 ETR pin    
  *            @arg TIM_TIM18_ETR_TIM4_ETR        TIM18 ETR is connected to TIM4 ETR pin    
  *            @arg TIM_TIM18_ETR_TIM5_ETR        TIM18 ETR is connected to TIM5 ETR pin  
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_RemapConfig(TIM_HandleTypeDef *htim, uint32_t Remap)
{
  /* Check parameters */
  assert_param(IS_TIM_REMAP_INSTANCE(htim->Instance));
  assert_param(IS_TIM_REMAP(Remap));

  __HAL_LOCK(htim);

  MODIFY_REG(htim->Instance->AF1, TIM1_AF1_ETRSEL_Msk, Remap);

  __HAL_UNLOCK(htim);

  return HAL_OK;
}

/**
  * @brief  Select the timer input source
  * @param  htim TIM handle.
  * @param  Channel specifies the TIM Channel
  *          This parameter can be one of the following values:
  *            @arg TIM_CHANNEL_1: TI1 input channel
  *            @arg TIM_CHANNEL_2: TI2 input channel
  *            @arg TIM_CHANNEL_3: TI3 input channel
  *            @arg TIM_CHANNEL_4: TI4 input channel
  * @param  TISelection specifies the timer input source
  *         For TIM1 this parameter can be one of the following values:
  *            @arg TIM_TIM1_TI1_GPIO:                TIM1 TI1 is connected to GPIO
  *            @arg TIM_TIM1_TI1_COMP1:               TIM1 TI1 is connected to COMP1 output
  *            @arg TIM_TIM1_TI1_COMP2:               TIM1 TI1 is connected to COMP2 output
  *            @arg TIM_TIM1_TI1_COMP3:               TIM1 TI1 is connected to COMP3 output
  *            @arg TIM_TIM1_TI1_COMP4:               TIM1 TI1 is connected to COMP4 output
  *
  *         For TIM2 this parameter can be one of the following values:
  *            @arg TIM_TIM2_TI1_GPIO:                TIM2 TI1 is connected to GPIO
  *            @arg TIM_TIM2_TI1_COMP1:               TIM2 TI1 is connected to COMP1 output
  *            @arg TIM_TIM2_TI1_COMP2:               TIM2 TI1 is connected to COMP2 output
  *            @arg TIM_TIM2_TI1_COMP3:               TIM2 TI1 is connected to COMP3 output
  *            @arg TIM_TIM2_TI1_COMP4:               TIM2 TI1 is connected to COMP4 output
  *            @arg TIM_TIM2_TI2_GPIO:                TIM1 TI2 is connected to GPIO
  *            @arg TIM_TIM2_TI2_COMP1:               TIM2 TI2 is connected to COMP1 output
  *            @arg TIM_TIM2_TI2_COMP2:               TIM2 TI2 is connected to COMP2 output
  *            @arg TIM_TIM2_TI2_COMP3:               TIM2 TI2 is connected to COMP3 output
  *            @arg TIM_TIM2_TI2_COMP4:               TIM2 TI2 is connected to COMP4 output
  *            @arg TIM_TIM2_TI3_GPIO:                TIM2 TI3 is connected to GPIO
  *            @arg TIM_TIM2_TI3_COMP4:               TIM2 TI3 is connected to COMP4 output
  *            @arg TIM_TIM2_TI4_GPIO:                TIM2 TI4 is connected to GPIO
  *            @arg TIM_TIM2_TI4_COMP1:               TIM2 TI4 is connected to COMP1 output
  *            @arg TIM_TIM2_TI4_COMP2:               TIM2 TI4 is connected to COMP2 output
  *
  *         For TIM3 this parameter can be one of the following values:
  *            @arg TIM_TIM3_TI1_GPIO:                TIM3 TI1 is connected to GPIO
  *            @arg TIM_TIM3_TI1_COMP1:               TIM3 TI1 is connected to COMP1 output
  *            @arg TIM_TIM3_TI1_COMP2:               TIM3 TI1 is connected to COMP2 output
  *            @arg TIM_TIM3_TI1_COMP3:               TIM3 TI1 is connected to COMP3 output
  *            @arg TIM_TIM3_TI1_COMP4:               TIM3 TI1 is connected to COMP4 output
  *            @arg TIM_TIM3_TI2_GPIO:                TIM3 TI2 is connected to GPIO
  *            @arg TIM_TIM3_TI2_COMP1:               TIM3 TI2 is connected to COMP1 output
  *            @arg TIM_TIM3_TI2_COMP2:               TIM3 TI2 is connected to COMP2 output
  *            @arg TIM_TIM3_TI2_COMP3:               TIM3 TI2 is connected to COMP3 output
  *            @arg TIM_TIM3_TI2_COMP4:               TIM3 TI2 is connected to COMP4 output
  *            @arg TIM_TIM3_TI3_GPIO:                TIM3 TI3 is connected to GPIO
  *            @arg TIM_TIM3_TI3_COMP3:               TIM3 TI3 is connected to COMP3 output
  *
  *         For TIM4 this parameter can be one of the following values:
  *            @arg TIM_TIM4_TI1_GPIO:                TIM4 TI1 is connected to GPIO
  *            @arg TIM_TIM4_TI1_COMP1:               TIM4 TI1 is connected to COMP1 output
  *            @arg TIM_TIM4_TI1_COMP2:               TIM4 TI1 is connected to COMP2 output
  *            @arg TIM_TIM4_TI1_COMP3:               TIM4 TI1 is connected to COMP3 output
  *            @arg TIM_TIM4_TI1_COMP4:               TIM4 TI1 is connected to COMP4 output
  *            @arg TIM_TIM4_TI2_GPIO:                TIM4 TI2 is connected to GPIO
  *            @arg TIM_TIM4_TI2_COMP1:               TIM4 TI2 is connected to COMP1 output
  *            @arg TIM_TIM4_TI2_COMP2:               TIM4 TI2 is connected to COMP2 output
  *            @arg TIM_TIM4_TI2_COMP3:               TIM4 TI2 is connected to COMP3 output
  *            @arg TIM_TIM4_TI2_COMP4:               TIM4 TI2 is connected to COMP4 output
  *            @arg TIM_TIM4_TI3_GPIO:                TIM4 TI3 is connected to GPIO
  *            @arg TIM_TIM4_TI3_COMP2:               TIM4 TI3 is connected to COMP2 output 
  *            @arg TIM_TIM4_TI4_GPIO:                TIM4 TI4 is connected to GPIO
  *            @arg TIM_TIM4_TI4_COMP3:               TIM4 TI4 is connected to COMP3 output 
  *
  *         For TIM5 this parameter can be one of the following values: 
  *            @arg TIM_TIM5_TI1_GPIO:                TIM5 TI1 is connected to GPIO
  *            @arg TIM_TIM5_TI1_LSI:                 TIM5 TI1 is connected to LSI clock        
  *            @arg TIM_TIM5_TI1_COMP1:               TIM5 TI1 is connected to COMP1 output     
  *            @arg TIM_TIM5_TI1_COMP2:               TIM5 TI1 is connected to COMP2 output     
  *            @arg TIM_TIM5_TI1_COMP3:               TIM5 TI1 is connected to COMP3 output     
  *            @arg TIM_TIM5_TI1_COMP4:               TIM5 TI1 is connected to COMP4 output     
  *            @arg TIM_TIM5_TI2_GPIO:                TIM5 TI2 is connected to GPIO
  *            @arg TIM_TIM5_TI2_COMP1:               TIM5 TI2 is connected to COMP1 output
  *            @arg TIM_TIM5_TI2_COMP2:               TIM5 TI2 is connected to COMP2 output
  *            @arg TIM_TIM5_TI2_COMP3:               TIM5 TI2 is connected to COMP3 output
  *            @arg TIM_TIM5_TI2_COMP4:               TIM5 TI2 is connected to COMP4 output
  *
  *         For TIM8 this parameter can be one of the following values:
  *            @arg TIM_TIM8_TI1_GPIO:                TIM8 TI1 is connected to GPIO
  *            @arg TIM_TIM8_TI1_COMP1:               TIM8 TI1 is connected to COMP1 output
  *            @arg TIM_TIM8_TI1_COMP2:               TIM8 TI1 is connected to COMP2 output
  *            @arg TIM_TIM8_TI1_COMP3:               TIM8 TI1 is connected to COMP3 output
  *            @arg TIM_TIM8_TI1_COMP4:               TIM8 TI1 is connected to COMP4 output
  *
  *         For TIM15 this parameter can be one of the following values:
  *            @arg TIM_TIM15_TI1_GPIO:                TIM15 TI1 is connected to GPIO
  *            @arg TIM_TIM15_TI1_COMP1:               TIM15 TI1 is connected to COMP1 output
  *            @arg TIM_TIM15_TI1_COMP2:               TIM15 TI1 is connected to COMP2 output
  *
  *            @arg TIM_TIM15_TI2_GPIO:                TIM15 TI2 is connected to GPIO
  *            @arg TIM_TIM15_TI2_COMP2:               TIM15 TI2 is connected to COMP2 output
  *            @arg TIM_TIM15_TI2_COMP3:               TIM15 TI2 is connected to COMP3 output
  *
  *         For TIM16 this parameter can be one of the following values:
  *            @arg TIM_TIM16_TI1_GPIO:                TIM16 TI1 is connected to GPIO
  *            @arg TIM_TIM16_TI1_MCO:                 TIM15 TI1 is connected to MCO output
  *            @arg TIM_TIM16_TI1_HSE_32:              TIM15 TI1 is connected to HSE div 32
  *            @arg TIM_TIM16_TI1_LSI:                 TIM15 TI1 is connected to LSI clock
  *
  *         For TIM17 this parameter can be one of the following values:
  *            @arg TIM_TIM17_TI1_GPIO:                TIM17 TI1 is connected to GPIO
  *            @arg TIM_TIM17_TI1_MCO:                 TIM17 TI1 is connected to MCO output
  *            @arg TIM_TIM17_TI1_HSE_32:              TIM17 TI1 is connected to HSE div 32
  *            @arg TIM_TIM17_TI1_LSI:                 TIM17 TI1 is connected to LSI clock
  *
  *         For TIM18 this parameter can be one of the following values:
  *            @arg TIM_TIM18_TI1_GPIO:                TIM18 TI1 is connected to GPIO
  *            @arg TIM_TIM18_TI1_COMP1:               TIM18 TI1 is connected to COMP1 output
  *            @arg TIM_TIM18_TI1_COMP2:               TIM18 TI1 is connected to COMP2 output
  *            @arg TIM_TIM18_TI1_COMP3:               TIM18 TI1 is connected to COMP3 output
  *            @arg TIM_TIM18_TI1_COMP4:               TIM18 TI1 is connected to COMP4 output
  *            @arg TIM_TIM18_TI2_GPIO:                TIM18 TI2 is connected to GPIO
  *            @arg TIM_TIM18_TI2_COMP1:               TIM18 TI2 is connected to COMP1 output
  *            @arg TIM_TIM18_TI2_COMP2:               TIM18 TI2 is connected to COMP2 output
  *            @arg TIM_TIM18_TI2_COMP3:               TIM18 TI2 is connected to COMP3 output
  *            @arg TIM_TIM18_TI2_COMP4:               TIM18 TI2 is connected to COMP4 output
  *
  *         For TIM10 this parameter can be one of the following values:
  *            @arg TIM_TIM10_TI1_GPIO:                TIM10 TI1 is connected to GPIO
  *            @arg TIM_TIM10_TI1_RTC:                 TIM10 TI1 is connected to RTC
  *            @arg TIM_TIM10_TI1_HSE_32:              TIM10 TI1 is connected to HSE div 32
  *            @arg TIM_TIM10_TI1_MCO:                 TIM10 TI1 is connected to MCO
  *
  *         For TIM11 this parameter can be one of the following values:
  *            @arg TIM_TIM11_TI1_GPIO:                TIM11 TI1 is connected to GPIO
  *            @arg TIM_TIM11_TI1_RTC:                 TIM11 TI1 is connected to RTC
  *            @arg TIM_TIM11_TI1_HSE_32:              TIM11 TI1 is connected to HSE div 32
  *            @arg TIM_TIM11_TI1_MCO:                 TIM11 TI1 is connected to MCO
  *
  *         For TIM13 this parameter can be one of the following values:
  *            @arg TIM_TIM13_TI1_GPIO:                TIM13 TI1 is connected to GPIO
  *            @arg TIM_TIM13_TI1_RTC:                 TIM13 TI1 is connected to RTC
  *            @arg TIM_TIM13_TI1_HSE_32:              TIM13 TI1 is connected to HSE div 32
  *            @arg TIM_TIM13_TI1_MCO:                 TIM13 TI1 is connected to MCO
  *
  *         For TIM14 this parameter can be one of the following values:
  *            @arg TIM_TIM14_TI1_GPIO:                TIM14 TI1 is connected to GPIO
  *            @arg TIM_TIM14_TI1_RTC:                 TIM14 TI1 is connected to RTC
  *            @arg TIM_TIM14_TI1_HSE_32:              TIM14 TI1 is connected to HSE div 32
  *            @arg TIM_TIM14_TI1_MCO:                 TIM14 TI1 is connected to MCO
  *
  *         For TIM19 this parameter can be one of the following values:
  *            @arg TIM_TIM19_TI1_GPIO:                TIM19 TI1 is connected to GPIO
  *            @arg TIM_TIM19_TI1_RTC:                 TIM19 TI1 is connected to RTC
  *            @arg TIM_TIM19_TI1_HSE_32:              TIM19 TI1 is connected to HSE div 32
  *            @arg TIM_TIM19_TI1_MCO:                 TIM19 TI1 is connected to MCO
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_TIMEx_TISelection(TIM_HandleTypeDef *htim, uint32_t TISelection, uint32_t Channel)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  assert_param(IS_TIM_TISEL_TIX_INSTANCE(htim->Instance, Channel));
  assert_param(IS_TIM_TISEL(TISelection));

  __HAL_LOCK(htim);

